### A Pluto.jl notebook ###
# v0.18.2

using Markdown
using InteractiveUtils

# ╔═╡ 63c7eced-5e1f-4018-b418-9be60a565f9d
md"""
# 시험관련 안내사항
"""

# ╔═╡ 71ef503c-c072-11ec-2ff8-5fa07fcd7f83
md"""
## 시험유형 

`-` 오픈북: 강의노트, 본인이 정리한 노트, 인터넷 검색 가능

`-` 비대면: Zoom을 활용하여 응시

## 시험시간

`-` 일시: LMS를 통해 공지한 날의 수업시간

`-` 시험시간 중 처음 30분은 장비점검시간으로 활용함 (단, 모든 사람이 준비될 경우 30분을 기다리지 않고 시작) 

- 따라서 2시간 수업일 경우 실질적으로 문제를 풀고 답안을 제출할때 까지 쓸 수 있는 시간은 1시간30분입니다.

## 시험실 입장 

`-` LMS $\to$ 강의대화 $\to$ Zoom 화상강의 바로 가기로 입장

## 시험문제 공개방식 

`-` LMS에 주피터노트북 파일 업로드 + LMS 공지사항을 통하여 시험문제의 URL을 공개
- 주피터파일의 장점: URL보다 LMS의 주피터노트북이 더 빠르게 공개됨. 
- URL의 장점: 시험문제의 오류가 있을 경우 수정이후 URL에 반영됨. 

## 제출 

`-` 답안지: LMS의 레포트 메뉴를 활용하여 답안지를 제출 (종료시간 이전에 미리 제출가능) 

`-` 동영상: 시험시간동안 컴퓨터전체화면 녹화후 제출 
- 듀얼모니터의 경우 작업표시줄이 나타나는 모니터를 녹화
- 아이패드와 동시사용시에는 아이패드도 함께 녹화 

## 준비물

`-` 컴퓨터 및 노트북: 시험지 확인 및 문제풀이 용도 

`-` 핸드폰: Zoom을 통하여 주변상황을 및 컴퓨터 화면을 촬영하는 용도 

- 중간에 핸드폰 및 노트북이 꺼지지 않도록 충전기를 준비한다. 

`-` 학생증 혹은 신분증 (본인확인용도)

## 시험 전 준비사항

`-` 시험준비시간 동안 핸드폰을 아래와 같이 배치하여 학생의 컴퓨터 화면 및 주변상황이 보이도록 함

![](https://github.com/guebin/2021IR/blob/master/_notebooks/img.png?raw=true)
- 적절한 각도를 설정하기 어려운 경우 주변환경보다 컴퓨터의 화면이 잘 보이도록 설정할 것 

`-` 학생증을 준비하여 시험 시작 직전에 본인의 얼굴과 학생증을 함께 촬영한다. (5초간) 

## 유의사항

`-` 줌의 대화명은 이름과 학번을 모두 적는다. (예시: 최규빈_202143052)
- 동명이인이 있을 수 있으므로 학번을 같이 적으세요

`-` 질문은 카카오톡 채널 혹은 줌의 채팅기능을 이용한다.  

`-` Zoom에서 스피커 음소거를 하지 않는다. (전체 공지사항등이 있을때 음성으로 공지함) 

`-` 핸드폰으로 Zoom참가 중 전화가 오면 거절하고 받지 않는다. (전화통화시 Zoom연결이 종료되므로 부정행위로 의심할 수 있음) 

## 기타 참고사항

`-` 핸드폰과 피씨를 이용하여 줌에 동시접속할 경우 아래와 같이 기기를 분리하여 적는다. 
- 최규빈_202143052_핸드폰
- 최규빈_202143052_컴퓨터

`-` 답안지 제출형식은 *.jl 을 권장한다. 하지만 풀이 및 코드를 알아볼 수 있는 어떠한 형식으로 제출하여도 무방하다. (ex: txt, hwp, pdf, html..)

"""

# ╔═╡ 00000000-0000-0000-0000-000000000001
PLUTO_PROJECT_TOML_CONTENTS = """
[deps]
"""

# ╔═╡ 00000000-0000-0000-0000-000000000002
PLUTO_MANIFEST_TOML_CONTENTS = """
# This file is machine-generated - editing it directly is not advised

julia_version = "1.7.2"
manifest_format = "2.0"

[deps]
"""

# ╔═╡ Cell order:
# ╟─63c7eced-5e1f-4018-b418-9be60a565f9d
# ╟─71ef503c-c072-11ec-2ff8-5fa07fcd7f83
# ╟─00000000-0000-0000-0000-000000000001
# ╟─00000000-0000-0000-0000-000000000002
